app/controllers/directs_controller.rb

SELECT "directs".* FROM "directs"
---
  def index
    @directs = Direct.all