app/controllers/hashtags_controller.rb

  def index
    @hashtags = Hashtag.where(:user_id => current_user)
---
SELECT "hashtags".* FROM "hashtags" WHERE "hashtags"."user_id" = 1